os2web_acadre_arp/test_data/request-8.soap.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><Publish xmlns="http://Acadre.Publishing.CMS.PublishingHandler.Demo"><info><ItemId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">c764188a-1edc-4b2d-be3e-b19eb337b225</ItemId><LocationId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">default</LocationId><Metadata xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">&lt;?xml version="1.0" encoding="utf-16"?&gt;
&lt;PublishedDocument xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.traen.com/2007/20/07/"&gt;
  &lt;AdministrativeUnit&gt;
    &lt;AdministrativeUnitGUID&gt;127f4700-88d7-48a0-b285-6d2271ec9694&lt;/AdministrativeUnitGUID&gt;
    &lt;AdministrativeUnitName&gt;Test enhed&lt;/AdministrativeUnitName&gt;
  &lt;/AdministrativeUnit&gt;
  &lt;Year&gt;2012&lt;/Year&gt;
  &lt;SequenceNumber&gt;69771&lt;/SequenceNumber&gt;
  &lt;Title&gt;Dette er en test&lt;/Title&gt;
  &lt;Description&gt;ester&lt;/Description&gt;
  &lt;Category&gt;Afg.&lt;/Category&gt;
  &lt;Status&gt;R&lt;/Status&gt;
  &lt;DocumentType&gt;U&lt;/DocumentType&gt;
  &lt;CreationDate&gt;2012-06-19&lt;/CreationDate&gt;
  &lt;LastModificationDate&gt;2012-06-19&lt;/LastModificationDate&gt;
  &lt;AttachmentDate&gt;2012-06-19&lt;/AttachmentDate&gt;
  &lt;JournalizationDate&gt;2012-06-19&lt;/JournalizationDate&gt;
  &lt;DocumentLatestVersion&gt;
    &lt;VersionNumber&gt;1&lt;/VersionNumber&gt;
    &lt;FileReferenceId&gt;3345850&lt;/FileReferenceId&gt;
    &lt;FileReferenceVersionId&gt;1&lt;/FileReferenceVersionId&gt;
    &lt;Comment /&gt;
  &lt;/DocumentLatestVersion&gt;
  &lt;DocResponsibleUser&gt;
    &lt;UserInitials&gt;acadre&lt;/UserInitials&gt;
    &lt;UserName&gt;acadre&lt;/UserName&gt;
  &lt;/DocResponsibleUser&gt;
  &lt;IsPaperBased&gt;false&lt;/IsPaperBased&gt;
  &lt;ArrayOfSendersReceivers /&gt;
&lt;/PublishedDocument&gt;</Metadata><PhysicalFileReference xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo"><FileName>Dette er en test.DOCX</FileName><ItemId>1635231</ItemId><Version>1</Version></PhysicalFileReference></info><parentItemId>0ad6f8db-04a1-44d7-b561-f42aa8c6858b</parentItemId></Publish></soap:Body></soap:Envelope>